app/Controllers/Ativo.php

    public function index()
    {
        $ativoModel = new AtivoModel();
        $ativos = $ativoModel->findAll();
---
SELECT *
FROM `Ativo`

    public function editar($id)
    {
        $method = $this->request->getMethod();
        if ($method === 'post') {
            $ativoModel = new AtivoModel();

            $data = [
                'Designacao' => $this->request->getVar('designacao'),
                'TipoAtivo' => $this->request->getVar('tipoAtivo'),
                'ValorFacial' => $this->request->getVar('valorFacial'),
                'DataEmissao' => $this->request->getVar('dataEmissao'),
                'QuantidadeDisponivel' => $this->request->getVar('quantidadeDisponivel'),
                'NomeEmpresa' => $this->request->getVar('nomeEmpresa')
            ];

            $ativoModel->where('CodigoAtivo', $id)->set($data)->update();
---
UPDATE `Ativo` SET `Designacao` = NULL, `TipoAtivo` = NULL, `ValorFacial` = NULL, `DataEmissao` = NULL, `QuantidadeDisponivel` = NULL, `NomeEmpresa` = NULL
WHERE `CodigoAtivo` = '18'

    public function detalhes($id)
    {
        $ativoModel = new AtivoModel();
        $ativo = $ativoModel->where('CodigoAtivo', $id)->first();
---
SELECT *
FROM `Ativo`
WHERE `CodigoAtivo` = '1'
 LIMIT 1

    public function excluir($id)
    {
        $method = $this->request->getMethod();
        if($method === 'post'){
            $ativoModel = new AtivoModel();
            $ativoModel->where('CodigoAtivo', $id)->delete();
---
DELETE FROM `Ativo`
WHERE `CodigoAtivo` = '14'