app/Controllers/Home.php

    public function index(): string
    {
        $ativoModel = new AtivoModel();
        $operacaoModel = new OperacaoModel();

        $total = $operacaoModel->selectSum('ValorTotal')->first();
        $negociacao = $operacaoModel->selectCount('CodigoAtivo')->first();
        $totalAtivos= $ativoModel->countAll();
        $operacoes = $operacaoModel->findAll();
        $totalOperacoes = $operacaoModel->countAll();
        $ativosBanner = $ativoModel->findAll(5);

        $valorTransacionado = $total['ValorTotal'] ?? 0;
        $ativosEmNegociacao = $negociacao['CodigoAtivo'] ?? 0;

        // gráfico de barras
        $dados = [];
        for ($mes = 1; $mes <= 12; $mes++) {
            $dataInicio = date('Y-m-d', mktime(0, 0, 0, $mes, 1, date('Y')));
            $dataFim = date('Y-m-d', mktime(0, 0, 0, $mes, 31, date('Y')));

            $valorTotal = $operacaoModel->selectSum('ValorTotal')
                ->where('DataOperacao >=', $dataInicio)
                ->where('DataOperacao <=', $dataFim)
                ->first()['ValorTotal'] ?? 0;
---
SELECT SUM(`ValorTotal`) AS `ValorTotal`
FROM `Operacao`
 LIMIT 1
SELECT *
FROM `Ativo`
SELECT COUNT(`CodigoAtivo`) AS `CodigoAtivo`
FROM `Operacao`
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `Ativo`
SELECT *
FROM `Operacao`
SELECT COUNT(*) AS `numrows` FROM `Operacao`
SELECT *
FROM `Ativo`
 LIMIT 5
SELECT SUM(`ValorTotal`) AS `ValorTotal`
FROM `Operacao`
WHERE `DataOperacao` >= '2024-01-01'
AND `DataOperacao` <= '2024-01-31'
 LIMIT 1


        // Gráfico de donut
        $dadosDonut = [];
        $tiposAtivos = $ativoModel->select('TipoAtivo')->distinct()->get()->getResultArray();

        foreach ($tiposAtivos as $tipoAtivo) {
            $valorTotal = $ativoModel->selectSum('ValorFacial')
                ->where('TipoAtivo', $tipoAtivo['TipoAtivo'])
                ->first()['ValorFacial'] ?? 0;
---
SELECT DISTINCT `TipoAtivo`
FROM `Ativo`
SELECT SUM(`ValorFacial`) AS `ValorFacial`
FROM `Ativo`
WHERE `TipoAtivo` = 'Títulos de participação'
 LIMIT 1